Arquivotheca/SunOS-4.1.4/man/man5/statmon.5
.\" @(#)statmon.5 1.1 94/10/31 SMI;
.TH STATMON 5 "19 October 1987"
.SH NAME
sm, sm.bak, state \- statd directories and file structures
.SH SYNOPSIS
.B /etc/sm
.B /etc/sm.bak
.B /etc/state
.SH DESCRIPTION
.IX "status monitor files for network services"
.IX "network services status monitor files"
.LP
.B /etc/sm
and
.B /etc/sm.bak
are directories generated by
.BR statd .
Each entry in
.B /etc/sm
represents the name of the machine to be monitored by the
.B statd
daemon.
Each entry in
.B /etc/sm.bak
represents the name of the machine to be notified by the
.B statd
daemon upon its recovery.
.LP
.B /etc/state
is a file generated by
.B statd
to record its version number.
This version number is incremented each time a crash or
recovery takes place.
.SH FILES
.PD 0
.TP 20
.B /etc/sm
.TP
.B /etc/sm.bak
.TP
.B /etc/state
.PD
.SH "SEE ALSO"
.LP
.BR lockd (8C),
.BR statd (8C)
