Arquivotheca/SunOS-4.1.4/man/man7/sunos.7
.\ "@(#)sunos.7 1.1 94/10/31 SMI;
.TH SUNOS 7 "30 September 1989"
.SH NAME
sunos, SunOS \- overview of the SunOS Release 4.1 environment
.SH SYNOPSIS
.B lint
.I sunos_src.c
.SH DESCRIPTION
.IX  "sunos"  ""  "\fLsunos\fP \(em SunOS Release 4.1 environment"
.IX  "operating system standards"  sunos  ""  "\fLsunos\fP \(em SunOS Release 4.1 environment"
.LP
The SunOS Release 4.1 lint library is a superset of the 4.3
.SM BSD
lint library.
It includes all of the 4.3
.SM BSD
functionality, most of System V release 3.2
functionality, as well as extensive additional
functionality in the networking and file system areas.
.LP
It is important to note that the default environment in SunOS Release 4.1
provides
.SM BSD
4.3 compatibility.  Sun also provides a System V 
compatible environment (see
.BR svidii (7V)).
.LP
Note that many man pages are marked with a \*(lqV\*(rq after the section
number, indicating some sort of System V compliance.  SunOS functions
are also documented on these man pages, as well as on man pages
without the \*(lqV\*(rq section suffix.
.LP
By default, the user will get the SunOS environment.  No path modifications
should be necessary.  The typical path is 
.BR "set path = ( /bin /usr/bin /usr/ucb )"
.SH FILES
.PD 0
.TP 20
.B /usr/bin/*
SunOS executables
.TP 20
.B /usr/ucb/*
.SM BSD
derived executables
.TP 20
.B /usr/include/*
SunOS specific header files
.TP
.B /usr/lib/*
SunOS specific library files
.PD
.SH "SEE ALSO"
.BR lint (1V),
.BR ansic (7V),
.BR bsd (7),
.BR posix (7V),
.BR svidii (7V),
.BR svidiii (7V),
.BR xopen (7V)
